; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_10 ?v8 ?v12)
             (pred_1 ?v2 ?v11)
             (pred_7 ?v8 ?v11)
             (pred_9 ?v4 ?v8 )
	     (pred_5 ?v8)
             (pred_6 ?v3)
             (pred_12 ?v2)
             (pred_3 ?v11)
             (pred_2 ?v8)
             (pred_11 ?v2)
             (pred_8 ?v8)
             (pred_4 ))



(:action op_5
:parameters (?v6 ?v5 ?v10 ?v1)
:precondition (and (pred_6 ?v6) (pred_6 ?v5) (pred_12 ?v10) (pred_3 ?v1)
          (pred_10 ?v6 ?v5) (pred_1 ?v10 ?v1)
                   (pred_7 ?v5 ?v1) (pred_5 ?v6) 
                   (pred_2 ?v5) (pred_11 ?v10))
:effect (and  (pred_8 ?v5) (not (pred_2 ?v5))))


(:action op_2
:parameters (?v6 ?v7)
:precondition (and (pred_6 ?v6) (pred_6 ?v7)
               (pred_5 ?v6) (pred_10 ?v6 ?v7) (pred_8 ?v7))
:effect (and (pred_5 ?v7) (not (pred_5 ?v6))))

(:action op_4
:parameters (?v6 ?v10)
:precondition (and (pred_6 ?v6) (pred_12 ?v10) 
                  (pred_5 ?v6) (pred_9 ?v10 ?v6) (pred_4 ))
:effect (and (pred_11 ?v10)
   (not (pred_9 ?v10 ?v6)) (not (pred_4 ))))


(:action op_3
:parameters (?v6 ?v13 ?v9)
:precondition (and (pred_6 ?v6) (pred_12 ?v13) (pred_12 ?v9)
                  (pred_5 ?v6) (pred_11 ?v9) (pred_9 ?v13 ?v6))
:effect (and (pred_11 ?v13) (pred_9 ?v9 ?v6)
        (not (pred_11 ?v9)) (not (pred_9 ?v13 ?v6))))

(:action op_1
:parameters (?v6 ?v10)
:precondition (and (pred_6 ?v6) (pred_12 ?v10) 
                  (pred_5 ?v6) (pred_11 ?v10))
:effect (and (pred_4 ) (pred_9 ?v10 ?v6) (not (pred_11 ?v10)))))

; problem
(define (problem grid-5-5-3-3-3)
    (:domain grid)
    (:objects
    obj_04 obj_25 obj_26 obj_22 obj_17 obj_28 obj_01 obj_30 obj_09 obj_08 obj_15 obj_03 obj_06 obj_05 obj_27 obj_18 obj_20 obj_11 obj_02 obj_23 obj_24 obj_14 obj_21 obj_19 obj_16
    obj_31 obj_29 obj_13
    obj_12 obj_10 obj_07
    )

    (:init
       (pred_4)

       (pred_6 obj_04)
       (pred_6 obj_25)
       (pred_6 obj_26)
       (pred_6 obj_22)
       (pred_6 obj_17)
       (pred_6 obj_28)
       (pred_6 obj_01)
       (pred_6 obj_30)
       (pred_6 obj_09)
       (pred_6 obj_08)
       (pred_6 obj_15)
       (pred_6 obj_03)
       (pred_6 obj_06)
       (pred_6 obj_05)
       (pred_6 obj_27)
       (pred_6 obj_18)
       (pred_6 obj_20)
       (pred_6 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_23)
       (pred_6 obj_24)
       (pred_6 obj_14)
       (pred_6 obj_21)
       (pred_6 obj_19)
       (pred_6 obj_16)
       (pred_3 obj_31)
       (pred_3 obj_29)
       (pred_3 obj_13)
       (pred_12 obj_12)
       (pred_12 obj_10)
       (pred_12 obj_07)

       (pred_10 obj_04 obj_28)
       (pred_10 obj_04 obj_25)
       (pred_10 obj_25 obj_01)
       (pred_10 obj_25 obj_26)
       (pred_10 obj_25 obj_04)
       (pred_10 obj_26 obj_30)
       (pred_10 obj_26 obj_22)
       (pred_10 obj_26 obj_25)
       (pred_10 obj_22 obj_09)
       (pred_10 obj_22 obj_17)
       (pred_10 obj_22 obj_26)
       (pred_10 obj_17 obj_08)
       (pred_10 obj_17 obj_22)
       (pred_10 obj_28 obj_15)
       (pred_10 obj_28 obj_01)
       (pred_10 obj_28 obj_04)
       (pred_10 obj_01 obj_03)
       (pred_10 obj_01 obj_30)
       (pred_10 obj_01 obj_25)
       (pred_10 obj_01 obj_28)
       (pred_10 obj_30 obj_06)
       (pred_10 obj_30 obj_09)
       (pred_10 obj_30 obj_26)
       (pred_10 obj_30 obj_01)
       (pred_10 obj_09 obj_05)
       (pred_10 obj_09 obj_08)
       (pred_10 obj_09 obj_22)
       (pred_10 obj_09 obj_30)
       (pred_10 obj_08 obj_27)
       (pred_10 obj_08 obj_17)
       (pred_10 obj_08 obj_09)
       (pred_10 obj_15 obj_18)
       (pred_10 obj_15 obj_03)
       (pred_10 obj_15 obj_28)
       (pred_10 obj_03 obj_20)
       (pred_10 obj_03 obj_06)
       (pred_10 obj_03 obj_01)
       (pred_10 obj_03 obj_15)
       (pred_10 obj_06 obj_11)
       (pred_10 obj_06 obj_05)
       (pred_10 obj_06 obj_30)
       (pred_10 obj_06 obj_03)
       (pred_10 obj_05 obj_02)
       (pred_10 obj_05 obj_27)
       (pred_10 obj_05 obj_09)
       (pred_10 obj_05 obj_06)
       (pred_10 obj_27 obj_23)
       (pred_10 obj_27 obj_08)
       (pred_10 obj_27 obj_05)
       (pred_10 obj_18 obj_24)
       (pred_10 obj_18 obj_20)
       (pred_10 obj_18 obj_15)
       (pred_10 obj_20 obj_14)
       (pred_10 obj_20 obj_11)
       (pred_10 obj_20 obj_03)
       (pred_10 obj_20 obj_18)
       (pred_10 obj_11 obj_21)
       (pred_10 obj_11 obj_02)
       (pred_10 obj_11 obj_06)
       (pred_10 obj_11 obj_20)
       (pred_10 obj_02 obj_19)
       (pred_10 obj_02 obj_23)
       (pred_10 obj_02 obj_05)
       (pred_10 obj_02 obj_11)
       (pred_10 obj_23 obj_16)
       (pred_10 obj_23 obj_27)
       (pred_10 obj_23 obj_02)
       (pred_10 obj_24 obj_14)
       (pred_10 obj_24 obj_18)
       (pred_10 obj_14 obj_21)
       (pred_10 obj_14 obj_20)
       (pred_10 obj_14 obj_24)
       (pred_10 obj_21 obj_19)
       (pred_10 obj_21 obj_11)
       (pred_10 obj_21 obj_14)
       (pred_10 obj_19 obj_16)
       (pred_10 obj_19 obj_02)
       (pred_10 obj_19 obj_21)
       (pred_10 obj_16 obj_23)
       (pred_10 obj_16 obj_19)
       (pred_2 obj_01)
       (pred_2 obj_09)
       (pred_2 obj_16)
       (pred_7  obj_01 obj_31)
       (pred_7  obj_09 obj_29)
       (pred_7  obj_16 obj_13)
       (pred_8 obj_04)
       (pred_8 obj_25)
       (pred_8 obj_26)
       (pred_8 obj_22)
       (pred_8 obj_17)
       (pred_8 obj_28)
       (pred_8 obj_30)
       (pred_8 obj_08)
       (pred_8 obj_15)
       (pred_8 obj_03)
       (pred_8 obj_06)
       (pred_8 obj_05)
       (pred_8 obj_27)
       (pred_8 obj_18)
       (pred_8 obj_20)
       (pred_8 obj_11)
       (pred_8 obj_02)
       (pred_8 obj_23)
       (pred_8 obj_24)
       (pred_8 obj_14)
       (pred_8 obj_21)
       (pred_8 obj_19)

       (pred_1  obj_12 obj_31)
       (pred_1  obj_10 obj_29)
       (pred_1  obj_07 obj_13)
       (pred_9 obj_12 obj_06)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_07 obj_24)
       (pred_5 obj_06)
    )

    (:goal (and
       (pred_9 obj_07 obj_11)
    ))
(:constraints
  (always (not (pred_5 obj_20)))
)
)

; plan
1. (op_2 obj_06 obj_11)
   deleted: (pred_5 obj_06)
   added: (pred_5 obj_11)
   goals met: 0 of 1
2. (op_2 obj_11 obj_21)
   deleted: (pred_5 obj_11)
   added: (pred_5 obj_21)
   goals met: 0 of 1
3. (op_2 obj_21 obj_14)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_14)
   goals met: 0 of 1
4. (op_2 obj_14 obj_24)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_24)
   goals met: 0 of 1
5. (op_4 obj_24 obj_07)
   deleted: (pred_9 obj_07 obj_24) (pred_4)
   added: (pred_11 obj_07)
   goals met: 0 of 1
6. (op_2 obj_24 obj_14)
   deleted: (pred_5 obj_24)
   added: (pred_5 obj_14)
   goals met: 0 of 1
7. (op_2 obj_14 obj_21)
   deleted: (pred_5 obj_14)
   added: (pred_5 obj_21)
   goals met: 0 of 1
8. (op_2 obj_21 obj_11)
   deleted: (pred_5 obj_21)
   added: (pred_5 obj_11)
   goals met: 0 of 1
9. (op_1 obj_11 obj_07)
   deleted: (pred_11 obj_07)
   added: (pred_4) (pred_9 obj_07 obj_11)
   goals met: 1 of 1
